; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared0 - mode
	image2 - mode
	infrared1 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Planet4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 174)
	(= (data Planet4 infrared0) 82)
	(= (data Planet5 infrared0) 60)
	(= (data Phenomenon6 infrared0) 254)
	(= (data Star7 infrared0) 9)
	(= (data Planet4 image2) 20)
	(= (data Planet5 image2) 138)
	(= (data Phenomenon6 image2) 31)
	(= (data Star7 image2) 133)
	(= (data Planet4 infrared1) 134)
	(= (data Planet5 infrared1) 285)
	(= (data Phenomenon6 infrared1) 198)
	(= (data Star7 infrared1) 226)
	(= (slew_time Star1 GroundStation0) 9.071)
	(= (slew_time GroundStation0 Star1) 9.071)
	(= (slew_time GroundStation3 GroundStation0) 13.54)
	(= (slew_time GroundStation0 GroundStation3) 13.54)
	(= (slew_time GroundStation3 Star1) 18.84)
	(= (slew_time Star1 GroundStation3) 18.84)
	(= (slew_time GroundStation3 GroundStation2) 55.69)
	(= (slew_time GroundStation2 GroundStation3) 55.69)
	(= (slew_time GroundStation2 GroundStation0) 62.06)
	(= (slew_time GroundStation0 GroundStation2) 62.06)
	(= (slew_time GroundStation2 Star1) 67.99)
	(= (slew_time Star1 GroundStation2) 67.99)
	(= (slew_time Planet4 GroundStation0) 48.19)
	(= (slew_time GroundStation0 Planet4) 48.19)
	(= (slew_time Planet4 Star1) 2.922)
	(= (slew_time Star1 Planet4) 2.922)
	(= (slew_time Planet4 GroundStation2) 38.18)
	(= (slew_time GroundStation2 Planet4) 38.18)
	(= (slew_time Planet4 GroundStation3) 14.78)
	(= (slew_time GroundStation3 Planet4) 14.78)
	(= (slew_time Planet5 GroundStation0) 74.16)
	(= (slew_time GroundStation0 Planet5) 74.16)
	(= (slew_time Planet5 Star1) 15.03)
	(= (slew_time Star1 Planet5) 15.03)
	(= (slew_time Planet5 GroundStation2) 8.82)
	(= (slew_time GroundStation2 Planet5) 8.82)
	(= (slew_time Planet5 GroundStation3) 12.45)
	(= (slew_time GroundStation3 Planet5) 12.45)
	(= (slew_time Planet5 Planet4) 40.61)
	(= (slew_time Planet4 Planet5) 40.61)
	(= (slew_time Phenomenon6 GroundStation0) 26.97)
	(= (slew_time GroundStation0 Phenomenon6) 26.97)
	(= (slew_time Phenomenon6 Star1) 60.22)
	(= (slew_time Star1 Phenomenon6) 60.22)
	(= (slew_time Phenomenon6 GroundStation2) 5.715)
	(= (slew_time GroundStation2 Phenomenon6) 5.715)
	(= (slew_time Phenomenon6 GroundStation3) 34.11)
	(= (slew_time GroundStation3 Phenomenon6) 34.11)
	(= (slew_time Phenomenon6 Planet4) 66.9)
	(= (slew_time Planet4 Phenomenon6) 66.9)
	(= (slew_time Phenomenon6 Planet5) 11.17)
	(= (slew_time Planet5 Phenomenon6) 11.17)
	(= (slew_time Star7 GroundStation0) 38.83)
	(= (slew_time GroundStation0 Star7) 38.83)
	(= (slew_time Star7 Star1) 36.08)
	(= (slew_time Star1 Star7) 36.08)
	(= (slew_time Star7 GroundStation2) 67.14)
	(= (slew_time GroundStation2 Star7) 67.14)
	(= (slew_time Star7 GroundStation3) 76.46)
	(= (slew_time GroundStation3 Star7) 76.46)
	(= (slew_time Star7 Planet4) 51.81)
	(= (slew_time Planet4 Star7) 51.81)
	(= (slew_time Star7 Planet5) 0.9414)
	(= (slew_time Planet5 Star7) 0.9414)
	(= (slew_time Star7 Phenomenon6) 28.44)
	(= (slew_time Phenomenon6 Star7) 28.44)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star7)
	(have_image Planet4 infrared1)
	(have_image Phenomenon6 infrared1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 groundstation2 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 174 to 118.31, (fuel-used) from 0 to 55.69
   goals met: 0 of 3
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 3
4. (turn_to satellite0 phenomenon6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 118.31 to 112.595, (fuel-used) from 55.69 to 61.405
   goals met: 0 of 3
5. (turn_to satellite0 star7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 112.595 to 84.155, (fuel-used) from 61.405 to 89.845
   goals met: 1 of 3
6. (turn_to satellite0 star1 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 84.155 to 48.075, (fuel-used) from 89.845 to 125.925
   goals met: 0 of 3
7. (turn_to satellite0 planet4 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 48.075 to 45.153, (fuel-used) from 125.925 to 128.847
   goals met: 0 of 3
8. (take_image satellite0 planet4 instrument0 infrared1)
   added: (have_image planet4 infrared1)
   changed: (data_capacity satellite0) from 1000 to 866, (data-stored) from 0 to 134
   goals met: 1 of 3
9. (turn_to satellite0 star1 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 45.153 to 42.231, (fuel-used) from 128.847 to 131.769
   goals met: 1 of 3
10. (turn_to satellite0 planet5 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 42.231 to 27.201, (fuel-used) from 131.769 to 146.799
   goals met: 1 of 3
11. (turn_to satellite0 phenomenon6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 27.201 to 16.031, (fuel-used) from 146.799 to 157.969
   goals met: 1 of 3
12. (take_image satellite0 phenomenon6 instrument0 infrared1)
   added: (have_image phenomenon6 infrared1)
   changed: (data_capacity satellite0) from 866 to 668, (data-stored) from 134 to 332
   goals met: 2 of 3
13. (turn_to satellite0 planet5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 16.031 to 4.861, (fuel-used) from 157.969 to 169.139
   goals met: 2 of 3
14. (turn_to satellite0 star7 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 4.861 to 3.9196, (fuel-used) from 169.139 to 170.08
   goals met: 3 of 3
